postgres_metrics/modified_run_b_postgres_threads_001_operations_15585.dat
//bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-III/conf:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/conf:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/postgrenosql-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/checker-qual-3.31.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/mongo-java-driver-3.11.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/postgresql-42.6.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/slf4j-simple-1.7.13.jar site.ycsb.Client -t -db site.ycsb.postgrenosql.PostgreNoSQLDBClient -P ./workloads/workloadb -threads 1 -p recordcount=15585 -P ./postgrenosql/conf/postgrenosql.properties
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 3666
[OVERALL], Throughput(ops/sec), 272.7768685215494
[TOTAL_GCS_G1_Young_Generation], Count, 3
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 16
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.436442989634479
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 16
[TOTAL_GC_TIME_%], Time(%), 0.436442989634479
[READ], Operations, 949
[READ], AverageLatency(us), 2985.7787144362487
[READ], MinLatency(us), 2616
[READ], MaxLatency(us), 34559
[READ], 95thPercentileLatency(us), 3447
[READ], 99thPercentileLatency(us), 4931
[READ], Return=OK, 949
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 956.0
[CLEANUP], MinLatency(us), 956
[CLEANUP], MaxLatency(us), 956
[CLEANUP], 95thPercentileLatency(us), 956
[CLEANUP], 99thPercentileLatency(us), 956
[SCAN], Operations, 51
[SCAN], AverageLatency(us), 7878.941176470588
[SCAN], MinLatency(us), 5328
[SCAN], MaxLatency(us), 19199
[SCAN], 95thPercentileLatency(us), 9887
[SCAN], 99thPercentileLatency(us), 11487
[SCAN], Return=OK, 51